ERP.belugaerp/src/InformationRegisters/бг_НастройкиИспользованияПодбораСерийКратноУпаковкам/бг_НастройкиИспользованияПодбораСерийКратноУпаковкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_НастройкиИспользованияПодбораСерийКратноУпаковкам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПравилаОкругленияДоКороба</name>
    <type>
      <types>EnumRef.бг_ПравилаОкругленияДоКороба</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_ПравилаОкругленияДоКороба/бг_ПравилаОкругленияДоКороба.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ПравилаОкругленияДоКороба</name>
  <enumValues>
    <name>ОкруглятьВсегда</name>
  </enumValues>
  <enumValues>
    <name>ОкруглятьЕслиНаОстаткеБольше</name>
  </enumValues>
  <enumValues>
    <name>НеОкруглять</name>
  </enumValues>
  <enumValues>
    <name>бг_РаспределятьСерииКратноКоробам</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/InformationRegisters/бг_НастройкиИспользованияПодбораСерийКратноУпаковкам/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает признак наличия настройки подбора серий по контрагенту
// Параметры:
// Контрагент - СправочникСсылка.Контрагенты
// ВидНоменклатуры - СправочникСсылка.ВидыНоменклатуры
// Организация - СправочникСсылка.Организации
// Дата - Дата
// 
// Возвращаемое значение:
//   - Булево
Функция ПодбиратьСерииКратноКоробкам(Контрагент, ВидНоменклатуры, Организация, Дата) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", КонецДня(Дата));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бг_НастройкиИспользованияПодбораСерийКратноУпаковкамСрезПоследних.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.бг_НастройкиИспользованияПодбораСерийКратноУпаковкам.СрезПоследних(
	|		&Период,
	|		Контрагент = &Контрагент
	|		И ВидНоменклатуры = &ВидНоменклатуры
	|		И Организация = &Организация
	|		И ПравилаОкругленияДоКороба = 
	|			ЗНАЧЕНИЕ(Перечисление.бг_ПравилаОкругленияДоКороба.бг_РаспределятьСерииКратноКоробам)) КАК бг_НастройкиИспользованияПодбораСерийКратноУпаковкамСрезПоследних";

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

#КонецОбласти
